app/controllers/api_base_controller.rb

  def fetch_loan_detail
    @loan = Loan.find_by(id: params[:id])
---
SELECT  "loans".* FROM "loans" WHERE "loans"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]