app/controllers/loans_controller.rb

  def index
    response_data = []
    Loan.includes(:payments).each do |loan|
      response_data << { loan_id: loan.id, outstanding_balance: loan.funded_amount - loan.payments.sum(:amount) }
---
SELECT "loans".* FROM "loans"
SELECT "payments".* FROM "payments" WHERE "payments"."loan_id" = ?  [["loan_id", 1]]
SELECT SUM("payments"."amount") FROM "payments" WHERE "payments"."loan_id" = ?  [["loan_id", 1]]

  def show
    outstanding_balance = @loan.funded_amount - @loan.payments.sum(:amount)
---
SELECT SUM("payments"."amount") FROM "payments" WHERE "payments"."loan_id" = ?  [["loan_id", 1]]