app/controllers/payments_controller.rb

  def show
    payment = @loan.payments.where(id: params[:payment_id])
---
SELECT "payments".* FROM "payments" WHERE "payments"."loan_id" = ?  [["loan_id", 1]]

  def create
    payment_amount = params[:amount].to_d
    return render json: { error: { message: 'Amount is not valid' } }, status: 422 unless payment_amount.to_d.positive?

    total_payment = @loan.payments.sum(:amount)
    if payment_amount > (@loan.funded_amount - total_payment)
      return render json: { error: { message: 'Amount Exceed' } }, status: 422
    end

    if @loan.payments.create(amount: payment_amount)
---
SELECT SUM("payments"."amount") FROM "payments" WHERE "payments"."loan_id" = ?  [["loan_id", 1]]
INSERT INTO "payments" ("amount", "loan_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["amount", 5.0], ["loan_id", 1], ["created_at", "2022-06-14 09:54:56.969348"], ["updated_at", "2022-06-14 09:54:56.969348"]]